balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ16GS402.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR7" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR7" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP14R" edc:desc="" edc:mask="0x3f" edc:name="RP14R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP15R" edc:desc="" edc:mask="0x3f" edc:name="RP15R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP14R0" edc:desc="" edc:mask="0x1" edc:name="RP14R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R1" edc:desc="" edc:mask="0x1" edc:name="RP14R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R2" edc:desc="" edc:mask="0x1" edc:name="RP14R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R3" edc:desc="" edc:mask="0x1" edc:name="RP14R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R4" edc:desc="" edc:mask="0x1" edc:name="RP14R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R5" edc:desc="" edc:mask="0x1" edc:name="RP14R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP15R0" edc:desc="" edc:mask="0x1" edc:name="RP15R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R1" edc:desc="" edc:mask="0x1" edc:name="RP15R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R2" edc:desc="" edc:mask="0x1" edc:name="RP15R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R3" edc:desc="" edc:mask="0x1" edc:name="RP15R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R4" edc:desc="" edc:mask="0x1" edc:name="RP15R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP15R5" edc:desc="" edc:mask="0x1" edc:name="RP15R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="16"/>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR16" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR16" edc:nzwidth="16" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP32R" edc:desc="" edc:mask="0x3f" edc:name="RP32R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP33R" edc:desc="" edc:mask="0x3f" edc:name="RP33R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP32R0" edc:desc="" edc:mask="0x1" edc:name="RP32R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP32R1" edc:desc="" edc:mask="0x1" edc:name="RP32R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP32R2" edc:desc="" edc:mask="0x1" edc:name="RP32R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP32R3" edc:desc="" edc:mask="0x1" edc:name="RP32R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP32R4" edc:desc="" edc:mask="0x1" edc:name="RP32R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP32R5" edc:desc="" edc:mask="0x1" edc:name="RP32R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP33R0" edc:desc="" edc:mask="0x1" edc:name="RP33R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP33R1" edc:desc="" edc:mask="0x1" edc:name="RP33R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP33R2" edc:desc="" edc:mask="0x1" edc:name="RP33R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP33R3" edc:desc="" edc:mask="0x1" edc:name="RP33R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP33R4" edc:desc="" edc:mask="0x1" edc:name="RP33R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP33R5" edc:desc="" edc:mask="0x1" edc:name="RP33R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR17" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR17" edc:nzwidth="16" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP34R" edc:desc="" edc:mask="0x3f" edc:name="RP34R" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP35R" edc:desc="" edc:mask="0x3f" edc:name="RP35R" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP34R0" edc:desc="" edc:mask="0x1" edc:name="RP34R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP34R1" edc:desc="" edc:mask="0x1" edc:name="RP34R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP34R2" edc:desc="" edc:mask="0x1" edc:name="RP34R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP34R3" edc:desc="" edc:mask="0x1" edc:name="RP34R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP34R4" edc:desc="" edc:mask="0x1" edc:name="RP34R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP34R5" edc:desc="" edc:mask="0x1" edc:name="RP34R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP35R0" edc:desc="" edc:mask="0x1" edc:name="RP35R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP35R1" edc:desc="" edc:mask="0x1" edc:name="RP35R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP35R2" edc:desc="" edc:mask="0x1" edc:name="RP35R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP35R3" edc:desc="" edc:mask="0x1" edc:name="RP35R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP35R4" edc:desc="" edc:mask="0x1" edc:name="RP35R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP35R5" edc:desc="" edc:mask="0x1" edc:name="RP35R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="76"/>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000011" edc:name="RCON" edc:nzwidth="0x10" edc:por="00----0000000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CM" edc:desc="" edc:mask="0x1" edc:name="CM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrr-nnnnnr-c--n" edc:cname="OSCCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-yyy000-0--0" edc:name="OSCCON" edc:nzwidth="16" edc:por="-000-yyy000-0--0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOLOCK" edc:desc="" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x7" edc:name="COSC" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:desc="" edc:mask="0x1" edc:name="NOSC2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:desc="" edc:mask="0x1" edc:name="COSC2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
